##Data Cleaning and Manipulation

Data cleaning and manipulation are essential steps in the data science pipeline to prepare datasets for analysis and modeling. The Python library Pandas, which provides the DataFrame object, is the most popular and powerful tool for these tasks.
Getting started with Pandas
First, you need to import the library and create a DataFrame.
python

In [ ]:
import pandas as pd
import numpy as np

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice'],
        'Age': [25, 30, np.nan, 28, 25],
        'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'New York'],
        'Salary': [85000, 80000, 95000, 75000, 85000]}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

Original DataFrame:
      Name   Age         City  Salary
0    Alice  25.0     New York   85000
1      Bob  30.0  Los Angeles   80000
2  Charlie   NaN      Chicago   95000
3    David  28.0     New York   75000
4    Alice  25.0     New York   85000

##Data cleaning techniques
1. Handling missing values

Missing values, often represented as NaN, are common in real-world data and can be handled in several ways.
Identifying missing values: Use the isnull() method to find missing values and sum() to count them.
python

In [ ]:
print("\nMissing values per column:")
print(df.isnull().sum())

Missing values per column:
Name      0
Age       1
City      0
Salary    0
dtype: int64

Dropping rows with missing values: Use dropna() to remove any rows containing missing data.
python

In [ ]:
df_dropped = df.dropna()
print("\nDataFrame after dropping rows with NaN:")
print(df_dropped)

DataFrame after dropping rows with NaN:
    Name   Age         City  Salary
0  Alice  25.0     New York   85000
1    Bob  30.0  Los Angeles   80000
3  David  28.0     New York   75000
4  Alice  25.0     New York   85000

Filling missing values: Use fillna() to replace missing values with a specified value, like the mean, median, or a constant.
python

In [ ]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
print("\nDataFrame after filling NaN ages with the mean:")
print(df)

DataFrame after filling NaN ages with the mean:
      Name   Age         City  Salary
0    Alice  25.0     New York   85000
1      Bob  30.0  Los Angeles   80000
2  Charlie  27.0      Chicago   95000
3    David  28.0     New York   75000
4    Alice  25.0     New York   85000

2. Removing duplicate data

Duplicate rows can skew analysis and should be identified and removed to maintain data integrity.
Finding duplicates: The duplicated() method returns a boolean Series indicating which rows are duplicates.
python

In [ ]:
print("\nDuplicate rows:")
print(df.duplicated(subset=['Name', 'Age', 'City']))

Duplicate rows:
0    False
1    False
2    False
3    False
4     True
dtype: bool

Dropping duplicates: drop_duplicates() removes duplicate rows based on all or a specific set of columns.
python

In [ ]:
df_unique = df.drop_duplicates()
print("\nDataFrame after dropping duplicate rows:")
print(df_unique)

DataFrame after dropping duplicate rows:
      Name   Age         City  Salary
0    Alice  25.0     New York   85000
1      Bob  30.0  Los Angeles   80000
2  Charlie  27.0      Chicago   95000
3    David  28.0     New York   75000

3. Correcting data types

Columns may not always have the correct data type, especially after importing from a file.
Checking data types: The dtypes attribute shows the data type for each column.
python

In [ ]:
print("\nInitial data types:")
print(df.dtypes)

Initial data types:
Name       object
Age       float64
City       object
Salary      int64
dtype: object

Converting data types: Use astype() to cast a column to a different type, such as converting a numeric column stored as an object to an integer or float.
python

In [ ]:
# For example, we could convert salary to float
df['Salary'] = df['Salary'].astype(float)
print(df)

      Name   Age         City   Salary
0    Alice  25.0     New York  85000.0
1      Bob  30.0  Los Angeles  80000.0
2  Charlie  27.0      Chicago  95000.0
3    David  28.0     New York  75000.0
4    Alice  25.0     New York  85000.0

##Data manipulation techniques

1. Selecting and filtering data

Selecting specific data is one of the most common DataFrame operations.
Selecting columns: Access one or more columns using single or double brackets.
python

In [ ]:
print("\nSelecting a single column ('Name'):")
print(df['Name'])

print("\nSelecting multiple columns ('Name' and 'Salary'):")
print(df[['Name', 'Salary']])

Selecting a single column ('Name'):
0      Alice
1        Bob
2    Charlie
3      David
4      Alice
Name: Name, dtype: object

Selecting multiple columns ('Name' and 'Salary'):
      Name   Salary
0    Alice  85000.0
1      Bob  80000.0
2  Charlie  95000.0
3    David  75000.0
4    Alice  85000.0

Filtering rows: Use boolean indexing to filter rows based on a condition.
python

In [ ]:
# Filter for all employees older than 28
older_employees = df[df['Age'] > 28]
print("\nEmployees older than 28:")
print(older_employees)

Employees older than 28:
  Name   Age         City   Salary
1  Bob  30.0  Los Angeles  80000.0

2. Creating new columns

You can add new columns based on existing data.
Creating a new column from calculations:
python

In [ ]:
df['Salary_in_thousands'] = df['Salary'] / 1000
print("\nDataFrame with new 'Salary_in_thousands' column:")
print(df)

DataFrame with new 'Salary_in_thousands' column:
      Name   Age         City   Salary  Salary_in_thousands
0    Alice  25.0     New York  85000.0                 85.0
1      Bob  30.0  Los Angeles  80000.0                 80.0
2  Charlie  27.0      Chicago  95000.0                 95.0
3    David  28.0     New York  75000.0                 75.0
4    Alice  25.0     New York  85000.0                 85.0

3. Grouping and aggregating data

This allows you to perform calculations on subsets of your data using the "Split-Apply-Combine" strategy.
Grouping by a column: Use groupby() followed by an aggregation function like mean() or sum().
python

In [ ]:
city_salary_average = df.groupby('City')['Salary'].mean()
print("\nAverage salary by city:")
print(city_salary_average)

Average salary by city:
City
Chicago        95000.000000
Los Angeles    80000.000000
New York       81666.666667
Name: Salary, dtype: float64

4. Merging and combining DataFrames

You can combine data from multiple sources using merge() or concat().
Using merge() for join operations:
python

In [ ]:
# Create a second DataFrame
more_data = pd.DataFrame({'Name': ['Alice', 'Charlie', 'Bob', 'David'], 'Department': ['HR', 'IT', 'HR', 'Mgmt']})
print(more_data)

# Merge the two DataFrames on the 'Name' column
merged_df = pd.merge(df, more_data, on='Name')
print("\nMerged DataFrame:")
print(merged_df)

      Name Department
0    Alice         HR
1  Charlie         IT
2      Bob         HR
3    David       Mgmt

Merged DataFrame:
      Name   Age         City   Salary  Salary_in_thousands Department
0    Alice  25.0     New York  85000.0                 85.0         HR
1      Bob  30.0  Los Angeles  80000.0                 80.0         HR
2  Charlie  27.0      Chicago  95000.0                 95.0         IT
3    David  28.0     New York  75000.0                 75.0       Mgmt
4    Alice  25.0     New York  85000.0                 85.0         HR